In [6]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass

In [7]:
password = getpass()

········

In [8]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [10]:
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [11]:
data.shape

(200, 4)

In [14]:
#How many distinct (different) actors' last names are there?
query = 'SELECT COUNT(DISTINCT last_name) \
FROM actor;' 
print(query)
data = pd.read_sql_query(query, engine)
data.head()

SELECT COUNT(DISTINCT last_name) FROM actor;

   COUNT(DISTINCT last_name)
0                        121

In [15]:
data1 = pd.read_sql_query('SELECT * FROM sakila.rental', engine)
data1.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [19]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query = '''SELECT rental_id, rental_date, DAYNAME(rental_date) as day_of_week, 
CASE 
    WHEN DAYOFWEEK(rental_date) IN (1,7) THEN 'weekend'
    ELSE 'workday'
END AS day_type
FROM rental;'''
print(query)
data1 = pd.read_sql_query(query, engine)
data1.head(20)

SELECT rental_id, rental_date, DAYNAME(rental_date) as day_of_week,
CASE
    WHEN DAYOFWEEK(rental_date) IN (1,7) THEN 'weekend'
    ELSE 'workday'
END AS day_type
FROM rental;

    rental_id         rental_date day_of_week day_type
0           1 2005-05-24 22:53:30     Tuesday  workday
1           2 2005-05-24 22:54:33     Tuesday  workday
2           3 2005-05-24 23:03:39     Tuesday  workday
3           4 2005-05-24 23:04:41     Tuesday  workday
4           5 2005-05-24 23:05:21     Tuesday  workday
5           6 2005-05-24 23:08:07     Tuesday  workday
6           7 2005-05-24 23:11:53     Tuesday  workday
7           8 2005-05-24 23:31:46     Tuesday  workday
8           9 2005-05-25 00:00:40   Wednesday  workday
9          10 2005-05-25 00:02:21   Wednesday  workday
10         11 2005-05-25 00:09:02   Wednesday  workday
11         12 2005-05-25 00:19:27   Wednesday  workday
12         13 2005-05-25 00:22:55   Wednesday  workday
13         14 2005-05-25 00:31:15   Wednesday  workday
14         15 2005-05-25 00:39:22   Wednesday  workday
15         16 2005-05-25 00:43:11   Wednesday  workday
16         17 2005-05-25 01:06:36   Wednesday  workday
17         18 2005-05-25 01:10:47   Wednesday  workday
18         19 2005-05-25 01:17:24   Wednesday  workday
19         20 2005-05-25 01:48:41   Wednesday  workday

In [30]:
data2 = pd.read_sql_query('SELECT * FROM sakila.film', engine)
data2.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [31]:
#Get all films with ARMAGEDDON in the title.
query = r'''SELECT title
FROM film
WHERE title like "%%ARMAGEDDON" OR title LIKE "ARMAGEDDON%%";'''   #Use two % sign to avoid error
print(query)
data2 = pd.read_sql_query(query, engine)
data2.head(20)

SELECT title
FROM film
WHERE title like "%%ARMAGEDDON" OR title LIKE "ARMAGEDDON%%";

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [32]:
#Get 10 the longest films.
query = '''SELECT MAX(length)
FROM film
LIMIT 10;'''
print(query)
data2 = pd.read_sql_query(query, engine)
data2.head(20)

SELECT MAX(length)
FROM film
LIMIT 10;

   MAX(length)
0          185

In [34]:
#How many films include Behind the Scenes content?
query = r'''SELECT special_features
FROM film
WHERE special_features LIKE "%%Behind the Scenes" OR special_features LIKE "Behind the Scenes%%";'''
print(query)
data2 = pd.read_sql_query(query, engine)
data2.head(20)

SELECT special_features
FROM film
WHERE special_features LIKE "%%Behind the Scenes" OR special_features LIKE "Behind the Scenes%%";

                                     special_features
0                    Deleted Scenes,Behind the Scenes
1                      Commentaries,Behind the Scenes
2                      Commentaries,Behind the Scenes
3                    Deleted Scenes,Behind the Scenes
4           Trailers,Deleted Scenes,Behind the Scenes
5             Trailers,Commentaries,Behind the Scenes
6                          Trailers,Behind the Scenes
7                          Trailers,Behind the Scenes
8       Commentaries,Deleted Scenes,Behind the Scenes
9       Commentaries,Deleted Scenes,Behind the Scenes
10                     Commentaries,Behind the Scenes
11                     Commentaries,Behind the Scenes
12                         Trailers,Behind the Scenes
13                   Deleted Scenes,Behind the Scenes
14                   Deleted Scenes,Behind the Scenes
15          Trailers,Deleted Scenes,Behind the Scenes
16      Commentaries,Deleted Scenes,Behind the Scenes
17  Trailers,Commentaries,Deleted Scenes,Behind th...
18          Trailers,Deleted Scenes,Behind the Scenes
19  Trailers,Commentaries,Deleted Scenes,Behind th...

In [ ]:
#Which kind of movies (rating) have a mean duration of more than two hours?

In [35]:
query = '''SELECT rating, ROUND(AVG(length),2) AS avg_length
FROM film
GROUP BY rating
HAVING AVG(length)>120;'''
print(query)
data2 = pd.read_sql_query(query, engine)
data2.head(20)

SELECT rating, ROUND(AVG(length),2) AS avg_length
FROM film
GROUP BY rating
HAVING AVG(length)>120;

  rating  avg_length
0  PG-13      120.44

In [36]:
#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.
query = '''SELECT title, length, RANK() OVER (ORDER BY length DESC) AS rank_no
FROM film
WHERE length IS NOT NULL AND length > 0
ORDER BY length DESC;'''
print(query)
data2 = pd.read_sql_query(query, engine)
data2.head(20)

SELECT title, length, RANK() OVER (ORDER BY length DESC) AS rank_no
FROM film
WHERE length IS NOT NULL AND length > 0
ORDER BY length DESC;

                 title  length  rank_no
0        CHICAGO NORTH     185        1
1       CONTROL ANTHEM     185        1
2       DARN FORRESTER     185        1
3          GANGS PRIDE     185        1
4            HOME PITY     185        1
5        MUSCLE BRIGHT     185        1
6         POND SEATTLE     185        1
7   SOLDIERS EVOLUTION     185        1
8    SWEET BROTHERHOOD     185        1
9         WORST BANGER     185        1
10   CONSPIRACY SPIRIT     184       11
11    CRYSTAL BREAKING     184       11
12      KING EVOLUTION     184       11
13     MOONWALKER FOOL     184       11
14     SMOOCHY CONTROL     184       11
15      SONS INTERVIEW     184       11
16      SORORITY QUEEN     184       11
17      THEORY MERMAID     184       11
18       CATCH AMISTAD     183       19
19      FRONTIER CABIN     183       19